Program primer;
var
  n: integer; //не удалять!!! нужна для работы меню
  // раздел для объявления переменных. 
  y, x: double;
  a, b, c, s: double;
Begin
        // не УДАЛЯТЬ!! Организовано меню
     writeln ('введите номер задачи');
     Readln(n);
case n of

//вычисление функции вариант 1
1:
  Begin 
  //задание 3.3
    writeln ('введите y');
    readln(y);
    If (y > 2) then x:= y + 2;
    If (y < 1) then x:= sqr(x) + 2*y + 0.3;
    If (1 <= y) and (y <= 2) then x:= power(y, 3) + 2*sqr(y) + 0.3*y + 1;
    writeln('Отве: ', x);
  end;

//вычисление функции вариант 2
2:
  Begin 
    // задача 3.5
    writeln('введите a');
    readln(a);
    writeln('введите b');
    readln(b);
    writeln('введите c');
    readln(c);
    S:= (a + b)/2 * sqrt (sqr(c) - sqr(a - b) /4);
    writeln(S);
  end;
  //вычисление функции вариант 3
3:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 4
4:
  Begin 
    // сюда пишем код программы варианта
  end;
  //вычисление функции вариант 5
5:
  Begin 
    // сюда пишем код программы варианта
  end;
//вычисление функции вариант 1
6:
  Begin 
    // сюда пишем код программы варианта
  end;
  end;
  end.